results/optimal_stress_2000/producer-test.log
9999 records sent, 1999.4 records/sec (1.95 MB/sec), 2.1 ms avg latency, 323.0 ms max latency.
10005 records sent, 2000.6 records/sec (1.95 MB/sec), 1.1 ms avg latency, 4.0 ms max latency.
10002 records sent, 2000.0 records/sec (1.95 MB/sec), 1.1 ms avg latency, 4.0 ms max latency.
10004 records sent, 2000.8 records/sec (1.95 MB/sec), 0.9 ms avg latency, 4.0 ms max latency.
50000 records sent, 1999.360205 records/sec (1.95 MB/sec), 1.26 ms avg latency, 323.00 ms max latency, 1 ms 50th, 2 ms 95th, 12 ms 99th, 24 ms 99.9th.